package main

import ("fmt"; "os")

func main(){
	fmt.Println("Какой  ASCII-арт хочешь?")
	fmt.Println("1 - Домик, 2 - Дерево, 3 - Машина")
	var choose int;

	tree := `
      *             ,
                  _/^\_
                 <     >
*                 /.-.\         *
         *        '/&\\'                   *
                 ,@.*;@,
                /_o.I %_\    *
   *           ('--:o(_@;
              /';--.,__ '')             *
             ;@'o % O,*''&\\
       *    ('--)_@ ;o %'()\\      *
            /';--._''--._O'@;
           /&*,()~o';-.,_ """)
*          /',@ ;+& () o*';-';\
          (""--.,_0 +% @' &()\
          /-.,_    ''''--....-'`)  *
     *    /@%;o':;'--,.__   __.'\
         ;*,&(); @ % &^;~'"'o;@();         *
         /(); o^~; & ().o@*&';&%O\
   jgs   "="==""==,,,.,="=="==="
      __.----.(\-''#####---...___...-----._
    '`         \)_""""
            .--' ')
          o(  )_-\
            """' `
`
	`

	fmt.Scanln(&choose)

	switch choose{
	case 1:
		fmt.Println("		                 _ _                          )                                     ")
		fmt.Println("                ( Y ))														)                                     ")
		fmt.Println("                 \ /  )												)                                     ")
		fmt.Println("                  \          /^\)							)			                                     ")
		fmt.Println("                    )       //^\\)					)	                                     ")
		fmt.Println("                 (         //   \\)			)	                                     ")
		fmt.Println("                   )      //     \\)                                     ")
		fmt.Println("                  __     //       \\)                                     ")
		fmt.Println("                 |=^|   //    _    \\)                                     ")
		fmt.Println("               __|= |__//    (+)    \\)                                     ")
		fmt.Println("              /LLLLLLL//      ~      \\)                                     ")
		fmt.Println("             /LLLLLLL//               \\)                                     ")
		fmt.Println("            /LLLLLLL//                 \\)                                     ")
		fmt.Println("           /LLLLLLL//  |~[|]~| |~[|]~|  \\)                                     ")
		fmt.Println("           ^| [|] //   | [|] | | [|] |   \\)                                     ")
		fmt.Println("            | [|] ^|   |_[|]_| |_[|]_|   |^)                                     ")
		fmt.Println("         ___|______|                     |)                                     ")
		fmt.Println("        /LLLLLLLLLL|_____________________|)                                     ")
		fmt.Println("       /LLLLLLLLLLL/LLLLLLLLLLLLLLLLLLLLLL\)                                     ")
		fmt.Println("      /LLLLLLLLLLL/LLLLLLLLLLLLLLLLLLLLLLLL\)                                     ")
		fmt.Println("      ^||^^^^^^^^/LLLLLLLLLLLLLLLLLLLLLLLLLL\)                                     ")
		fmt.Println("       || |~[|]~|^^||^^^^^^^^^^||^|~[|]~|^||^^)                                     ")
		fmt.Println("       || | [|] |  ||  |~~~~|  || | [|] | ||)                                     ")
		fmt.Println("       || |_[|]_|  ||  | [] |  || |_[|]_| ||)                                     ")
		fmt.Println("       ||__________||  |   o|  ||_________||)                                              ")
		fmt.Println("     .'||][][][][][||  | [] |  ||[][][][][||.'.)                                          ")
		fmt.Println("    ."'||[][][][][]||_-`----'-_||][][][][]||".")                                           ")
		fmt.Println("  .(')^(.)(').( )'^@/-- -- - --\@( )'( ).(( )^(.)^)                                        ")
		fmt.Println(" '( )^(`)'.(').( )@/-- -- - -- -\@ (.)'(.),( ).(')).                                       ")
		fmt.Println(" ".'.'." ." '.". @/- - --- -- - -\@ '.".'.".'.".'.)"                                       ")
		fmt.Println(" ". '' ".".".'.'@/ - -- -- -- -- -\@".'..'".'."'.').'                                      ")
		fmt.Println("'.".".''.".''."@/ -- --- --- -- - -\@.".''.".''.".)'".                                     ")
			case 2:
		    tree := `      *             ,
                  _/^\_
                 <     >
*                 /.-.\         *
         *        '/&\'                   *
                 ,@.*;@,
                /_o.I %_\    *
   *           ('--:o(_@;
              /';--.,__ '')             *
             ;@'o % O,*''&\
       *    ('--)_@ ;o %'()\      *
            /';--._''--._O'@;
           /&*,()~o';-.,_ """)
*          /',@ ;+& () o*';-';\
          (""--.,_0 +% @' &()\
          /-.,_    ''''--....-'`)  *
     *    /@%;o':;'--,.__   __.'\
         ;*,&(); @ % &^;~'"'o;@();         *
         /(); o^~; & ().o@*&';&%O\
   jgs   "="==""==,,,.,="=="==="
      __.----.(\-''#####---...___...-----._
    ` + "`" + `         \)_""""
            .--' ')
          o(  )_-\
            """' ` + "`"

    fmt.Print(tree)
})